[
  {
    "id": "software-engineer",
    "title": "Software Engineer",
    "description": "General software engineering interview covering algorithms, data structures, and system design",
    "difficulty": "mid",
    "questionsPool": [
      "Tell me about yourself and your experience with software development",
      "Explain the difference between a stack and a queue",
      "How would you design a URL shortening service like bit.ly?",
      "What is your experience with version control systems?",
      "Explain the concept of Big O notation",
      "How do you approach debugging a complex issue?",
      "What are design patterns you frequently use?"
    ]
  },
  {
    "id": "frontend-developer",
    "title": "Frontend Developer",
    "description": "Frontend development interview focusing on React, JavaScript, and web technologies",
    "difficulty": "mid",
    "questionsPool": [
      "What is your experience with React and modern frontend frameworks?",
      "Explain the virtual DOM and how React uses it",
      "How do you manage state in a large React application?",
      "What are React hooks and how do they work?",
      "How would you optimize the performance of a web application?",
      "Explain the difference between CSS Grid and Flexbox",
      "How do you ensure web accessibility in your applications?"
    ]
  },
  {
    "id": "backend-developer",
    "title": "Backend Developer",
    "description": "Backend development interview covering APIs, databases, and server-side technologies",
    "difficulty": "mid",
    "questionsPool": [
      "What is your experience with backend development?",
      "Explain RESTful API design principles",
      "How would you design a database schema for a social media platform?",
      "What is the difference between SQL and NoSQL databases?",
      "How do you handle authentication and authorization?",
      "Explain caching strategies and when to use them",
      "How would you scale a backend service to handle millions of users?"
    ]
  },
  {
    "id": "data-scientist",
    "title": "Data Scientist",
    "description": "Data science interview covering machine learning, statistics, and data analysis",
    "difficulty": "senior",
    "questionsPool": [
      "Tell me about your experience with machine learning",
      "Explain the difference between supervised and unsupervised learning",
      "How would you handle missing data in a dataset?",
      "What is overfitting and how do you prevent it?",
      "Explain the bias-variance tradeoff",
      "How do you evaluate the performance of a machine learning model?",
      "Describe a data science project you've worked on"
    ]
  },
  {
    "id": "devops-engineer",
    "title": "DevOps Engineer",
    "description": "DevOps interview covering CI/CD, infrastructure, and automation",
    "difficulty": "senior",
    "questionsPool": [
      "What is your experience with DevOps practices?",
      "Explain the concept of Infrastructure as Code",
      "How would you set up a CI/CD pipeline?",
      "What is containerization and why is it important?",
      "Explain the difference between Docker and Kubernetes",
      "How do you monitor and troubleshoot production systems?",
      "What is your experience with cloud platforms like AWS or Azure?"
    ]
  }
]
